In [6]:
#conda install pandas
#pandas data = data frame 
#pandas.pydata.org
#rows and columns 
#excel,sql, data base, mysql, parvo
#https://pandas.pydata.org/docs/getting_started/intro_tutorials/01_table_oriented.html

import pandas as pd

df = pd.DataFrame(
    {
        "Name": [ #key
            "Braund, Mr. Owen Harris", #values
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [7]:
#A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. 
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [8]:
#each column in a dataframe is a series 
df["Age"] #just want the key 'age'

0    22
1    35
2    58
Name: Age, dtype: int64

In [10]:
#create series from scratch 
ages = pd.Series([22, 35, 58], name="Age")
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [11]:
df["Age"].max()

58

In [12]:
ages.max()

58

In [13]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000